import streamlit as st
from streamlit_lottie import st_lottie
import json
st.set_page_config(layout="wide")
from PIL import Image

danka = Image.open("d.png")
martina = Image.open("mt.png")
marika = Image.open("mg.png")


st.page_link("Дома.py", label="Дома")

title = """<div style='text-align:center' ><h2>Дознајте повеќе за вашите инстурктори</h2></div>"""

st.markdown(title,unsafe_allow_html=True)

st.write("")
st.write("")
st.write("")


with st.container():
    col, col1, col2, col3, coll = st.columns(5)
    with col:
        st.image(marika)
        st.write("")
        with st.expander("Марика Георгиевска"):
            st.write("Јас сум Марика Георгиевска и учам во Математичко-информатичката гимназија во Скопје – училиште што нуди одлична подготовка во областа на природно-математичките науки. Имам голем интерес кон математиката, физиката и информатиката, а мојата посветеност се огледува преку освоените награди на државни натпревари по математика и физика. Исто така, сум учествувала на натпревари по информатика, како и на олимпијади по математика, што ми овозможија да стекнам искуство во решавање на предизвикувачки задачи и работа под притисок. Покрај академските активности, долги години бев активен член на клуб за гимнастика и карате. Преку тие спортови развив дисциплина, физичка издржливост и внатрешна мотивација – квалитети што ми помагаат и во учењето. Верувам дека комбинацијата од љубовта кон науката и спортот ме обликува како одговорна, упорна и амбициозна личност, секогаш подготвена да вложува труд и да се соочува со нови предизвици.")
    with col2:
        st.image(danka)
        st.write("")
        with st.expander("Данка Јефтимова"):
            st.write("Јас сум Данка Јефтимова, ученичка во Математичко-информатичката гимназија во Скопје, каде што љубопитноста и страста кон науката секојдневно се претвораат во нови знаења и успеси. Наскоро ќе бидам ученик во четврта година, а мојот фокус е насочен кон математиката и програмирањето, области во кои активно се натпреварувам и освојувам награди на национално ниво. Учествував на повеќе државни олимпијади по математика и информатика, каде што постигнав значајни резултати и признанија, кои го одразуваат моето континуирано залагање и љубов кон аналитичкото размислување и логичкото решавање проблеми. Покрај натпреварите, сум дел од меѓународни Еразмус+ проекти, каде што соработувам со ученици од различни земји на теми како одржлив дигитализација, интеркултурна интеграција и одговорно користење на технологијата. Надвор од училишните активности, редовно посетувам онлајн курсеви и обуки од реномирани платформи, со цел да го проширувам моето знаење и да останам во чекор со новите трендови во науката и технологијата. Верувам дека континуираното вложување во себе е клучот за успех, па затоа често организирам и бесплатни часови по математика и програмирање за помлади ученици, со желба да ги мотивирам и инспирирам да ја засакаат науката.")
    with coll:
        st.image(martina)
        st.write("")
        with st.expander("Мартина Трендафилова"):
            st.write("Јас сум Мартина Трендафилова, ученичка во Математичко-информатичката гимназија во Скопје – училиште каде љубовта кон науката се претвора во конкретни резултати. Моите главни области на интерес се математиката и физиката, каде имам освоено бројни награди, признанија и медали на национални натпревари. Покрај натпреварувачките успеси, сум активно вклучена и во меѓународни Еразмус+ проекти низ Европа, фокусирани на теми како глобално затоплување, заштита на животната средина и развој на зелени технологии. Овие проекти ми дадоа можност да соработувам со ученици од различни земји и да работам на решенија кои придонесуваат за поодржлива иднина. Исто така, со голема посветеност одржував часови по математика и физика за ученици од различни возрасти, споделувајќи го моето знаење и мотивирајќи ги да ја откријат убавината на природните науки.")